{
  "image": "https://raw.githubusercontent.com/KedisPL/Exotelcraft-Hub/main/main/images/update_image.png",
  "title": "Exotelcraft latest news!",
  "description": "EXOTELCRAFT - 6.3.0 RELEASE\n\nA new version is here! No additional libraries are required anymore. Spears for mod materials have been added, the Bedrock Style UI has been overhauled and is now enabled by default, and more 25w14craftmine features have been included. Plus, various other improvements and bug fixes!\n\nHappy playing!\n\nCHANGES IN: 6.3.0 RELEASE:\n- [Fabric] Fabric API is no longer required!\n- [NeoForge] Kriforfab is no longer required!\n- When fabric-item-group-api-v1 is missing on Fabric, a new Creative Tabs system will be enabled in Creative mode.\n- Bedrock Style UI is now enabled by default and related strings have been updated.\n- The Bedrock Style UI has been overhauled. The Bedrock Title Screen and many other elements are now defined via JSON, along with many other UI changes.\n- Added Opal, Ruby, and Upgraded Ruby Spears.\n- Added missing translation key for minecraft:grid_carrier.\n- [Fabric] Re-added datafixers for entities and block entities from the mod.\n- Shipwrecks now generate in the Potato Dimension as they did in the 24w14potato snapshot.\n- Pillager patrols no longer spawn in the Potato Dimension as they didn't in the 24w14potato snapshot.\n- Added in-game mod updater.\n- Corrupted Ender Map regions will now regenerate.\n- Some Ender Map related improvements.\n- Packed Ice now generates instead of Lava in Exotel caves.\n- Upgraded Ruby weapons and tools are now fire resistant.\n- The Experiments button has been removed from Exotelcraft options.\n- [NeoForge] Added \"Not available on NeoForge.\" message to the 25w14craftmine option tooltip.\n- [NeoForge] Prevented creating worlds on NeoForge when the Hub (25w14craftmine) world preset or 25w14craftmine game rule is selected. A warning dialog now appears explaining the restriction with an option to reset the conflicting settings.\n- April Fools' internal variables now reset when you disconnect.\n- Some translation corrections.\n- Some small changes.\n\nFIXED BUGS IN: 6.3.0 RELEASE:\n- Fixed crouching on minecraft:grid_carrier.\n- Some other fixes related to minecraft:grid_carrier.\n- Fixed \"You died!\" text in the Death Screen when Bedrock Style UI is enabled.\n- Fixed \"Failed to read <world_path> lock\" when using the back button in the Bedrock Edit World screen.\n- Fixed \"Failed to load map region r.x.x.nbt\" spam when the Ender Map region file was corrupted.\n- Fixed Potatification enchantment appearing when the 24w14potato gamerule was disabled (if it somehow still appears, it won't function).\n- Fixed broken biome blending on chunk edges in the Ender Map.\n- Some other fixes with the Ender Map.\n- Fixed some issues with April Fools' syncing which would cause a crash when joining a server (LAN world) with 25w14craftmine enabled.\n- Some small fixes.\n\n----------------------------------------\n\nEXOTELCRAFT - 6.2.0 RELEASE\n\nA new version for Minecraft 1.21.10 has been released that adds a world map using the new Ender Map item, as well as most of the content from 25w14craftmine!\n\nHappy playing!\n\nCHANGES IN: 6.2.0 RELEASE:\n- Added an Ender Map. A new item that allows you to see the world map with markers and other features.\n- Most of 25w14craftmine has been added, but there are still minor things to fix and add.\n- All Exotelcraft chests were added to \"c\" chest tags.\n- The ability to change mod keybinds has been added to the options menu.\n- The UI in Bedrock Edition style (OreUI) now has buttons and other components defined in JSON. The new screens will also be defined in JSON (\"exotelcraft\\ui\"). A new death screen has also been added.\n- Polish translations have been added for 24w14potato and 25w14craftmine (PL: przetłumaczone przy użyciu AI i poprawione, więc proszę dać znać, jeżeli są błędy).\n- Advancements from the April Fools' features are now only enabled if the specific snapshot gamerule is enabled.\n- Improved SVG support in Exotelcraft Hub.\n- Some small changes.\n\nFIXED BUGS IN: 6.2.0 RELEASE:\n- Fixed player rendering in 2D instead of 3D in the hotbar when 3D Shareware v1.34 is enabled. You no longer need to click F5 to fix it.\n- The Locator Bar no longer overlaps the hotbar in 3D Shareware v1.34.\n- The title in the Fletching Table screen has been fixed in 24w14potato.\n- [Affected Multiplayer] Fixed a bug where all players would teleport when one player teleported to another dimension and couldn't exit it.\n- If mods modify the rendering of entities and this is not supported in the inventory, entities will not render in Mob Trophies instead of causing the game to crash.\n- [NeoForge] Exotelcraft fluids should now work correctly.\n- Some fixes related to April Fools' features.\n- Some small fixes."
}
