{
	"image": "https://raw.githubusercontent.com/KedisPL/Exotelcraft-Hub/main/main/images/update_image.png",
	"title": "Exotelcraft latest news!",
	"description": "EXOTELCRAFT - 6.0.0 BETA-2\nThe last BETA version for 6.0.0 with many fixes! The next one will be the full release.\nEnjoy playing!\n\nCHANGES IN: 6.0.0 BETA-2\n- Added more stuff from 3D Shareware v1.34 and 24w14potato.\n- Changed mod networking and packet system.\n- Added special compatibility with Flashback mod.\n- Changed the mod download interface in the Exotelcraft Hub. Instead of clicking on a mod to download it, there is a green download button and a download progress interface has been added.\n- Added an option to see the mod's description in the Exotelcraft Hub when you quickly left-click on it twice. NOTE: This is a very early implementation and there may be duplicate text, incorrect formatting, missing formatting and the like. Mod search should work better and the search feature is more optimized overall.\n- Bedrock style interface screens now have a fixed scale.\n- Minor changes to the bedrock style interface (Ore UI).\n- Added April Fool's settings to the Exotelcraft options.\n- Other minor changes.\n\nFIXED BUGS IN: 6.0.0 BETA-2\n- Fixed better_transformation gamerule synchronization in multiplayer.\n- Fixed texts containing april fools to April Fools' in en_us.\n- Fixed display of potato background with effects in Potato Poem screen.\n- Improved compatibility with mods. Examples of mods that now work (not necessarily 100%): Replay Mod (breaks some mod things like: Floatater) and Flashback.\n- Fixed the location of the Exotelcraft button in the vanilla title screen.\n- #12 It is now possible to join vanilla servers, but it is not a good idea due to broken blocks.\n- Fixed a crash related to the Big Moon rule.\n- Fixed a crash related to overlapping the sun and moon in dimensions that have such others.\n- minecraft:grid_carrier (with Floatater) could crash when entering the world while trying to render (mainly with Sodium and Iris Shaders).\n- Fixed disappearing transformation when leaving The End through the portal after killing the Ender Dragon the first time (completing the game) and when falling into the void in the potato dimension.\n- Cracked Blimstone Tile and Brick recipes were producing Cracked Deepslate Tiles and Bricks.\n- Fixed a crash with Iris Shaders when transforming into certain entities such as the Ender Dragon.\n- Fixed Poisonous Potato Cutter.\n- Fixed Potato Refinery crash (recipes from json still not working at this point).\n- [NeoForge] minecraft:grid_carrier (from Floatater) was not rendering.\n- [NeoForge] Poisonous Potato Plant conversation was not rendering.\n- Other small fixes."
}
