{
	"image": "https://raw.githubusercontent.com/KedisPL/Exotelcraft-Hub/main/main/images/update_image.png",
	"title": "Exotelcraft latest news!",
	"description": "EXOTELCRAFT - 6.0.0 RELEASE\nThe full 6.0.0 release is here! This version includes everything from the previous ALPHA and BETA versions for 6.0.0 and fixes a lot of bugs and incompatibilities as well as adding little things.\nHappy playing!\n\nCHANGES IN: 6.0.0 RELEASE\n- The license has been changed from Exotelcraft Copyright Notice to EXOTELCRAFT LICENSE 1.0. It looks more professional now and a few things have been added.\n- The distribution of biomes in Exotel has been changed. They are now larger.\n- Added to the end of Herobrine Ruby Sword: (UNUSED).\n- Entities will now receive Dark Water effects when they are in blocks that contain Dark Water.\n- Added some stuff from the mod to more vanilla tags.\n- Updated tips in loading screens (UI in Bedrock Edition style).\n- The appearance of pop-ups in the Bedrock-style interface has been updated.\n- Changed the name of the mod search engine in the Exotelcraft Hub from Modrinth to Download mods.\n- Added an installed mods browser in the Exotelcraft Hub.\n- Added pages in Download mods.\n- Improved a few things in the Exotelcraft Hub.\n- Added the Exotelcraft Hub button to the vanilla Title Screen.\n- The mod code is now obfuscated.\n- Improved compatibility with other mods.\n- Other minor changes.\n\nFIXED BUGS IN: 6.0.0 RELEASE\n- The Better Third Person mod should now work with Exotelcraft.\n- Fixed items not dropping out of mod blocks when certain mods like Veinminer are installed.\n- The Locked Chest interface has been fixed, and it has also been improved.\n- Fixed the lack of Dark Water in Stalk Veins when generated in them.\n- Fixed some crashes in the Exotelcraft Hub.\n- Some other fixes.\n\nEXOTELCRAFT - 6.0.0 BETA-2\nThe last BETA version for 6.0.0 with many fixes! The next one will be the full release.\nEnjoy playing!\n\nCHANGES IN: 6.0.0 BETA-2\n- Added more stuff from 3D Shareware v1.34 and 24w14potato.\n- Changed mod networking and packet system.\n- Added special compatibility with Flashback mod.\n- Changed the mod download interface in the Exotelcraft Hub. Instead of clicking on a mod to download it, there is a green download button and a download progress interface has been added.\n- Added an option to see the mod's description in the Exotelcraft Hub when you quickly left-click on it twice. NOTE: This is a very early implementation and there may be duplicate text, incorrect formatting, missing formatting and the like. Mod search should work better and the search feature is more optimized overall.\n- Bedrock style interface screens now have a fixed scale.\n- Minor changes to the bedrock style interface (Ore UI).\n- Added April Fool's settings to the Exotelcraft options.\n- Other minor changes.\n\nFIXED BUGS IN: 6.0.0 BETA-2\n- Fixed better_transformation gamerule synchronization in multiplayer.\n- Fixed texts containing april fools to April Fools' in en_us.\n- Fixed display of potato background with effects in Potato Poem screen.\n- Improved compatibility with mods. Examples of mods that now work (not necessarily 100%): Replay Mod (breaks some mod things like: Floatater) and Flashback.\n- Fixed the location of the Exotelcraft button in the vanilla title screen.\n- #12 It is now possible to join vanilla servers, but it is not a good idea due to broken blocks.\n- Fixed a crash related to the Big Moon rule.\n- Fixed a crash related to overlapping the sun and moon in dimensions that have such others.\n- minecraft:grid_carrier (with Floatater) could crash when entering the world while trying to render (mainly with Sodium and Iris Shaders).\n- Fixed disappearing transformation when leaving The End through the portal after killing the Ender Dragon the first time (completing the game) and when falling into the void in the potato dimension.\n- Cracked Blimstone Tile and Brick recipes were producing Cracked Deepslate Tiles and Bricks.\n- Fixed a crash with Iris Shaders when transforming into certain entities such as the Ender Dragon.\n- Fixed Poisonous Potato Cutter.\n- Fixed Potato Refinery crash (recipes from json still not working at this point).\n- [NeoForge] minecraft:grid_carrier (from Floatater) was not rendering.\n- [NeoForge] Poisonous Potato Plant conversation was not rendering.\n- Other small fixes.\n\nEXOTELCRAFT - 6.0.0 BETA-1\nA new update that brings better transformation into entities and many bug fixes and other things!\nHappy exploring!\n\nCHANGES IN: 6.0.0 BETA-1\n- Added support for the WebP image format in the Exotelcraft Hub (This solves the problem with 99% of mod icons being missing).\n- Added game rule better_transformation, which makes transformed entities have the attributes and abilities (currently only effects like Wither effect from Wither Skeleton and some other stuff) of the entity they are transformed into; it also displays humanoid entities' hands on the player's screen and removes hunger. Enabled by default.\n- Giant now has an AI (#29).\n- All entities which had they potato variant in 24w14potato snapshot now have in Exotelcraft.\n- Updated red button texture in Ore UI (Bedrock like UI).\n- Added News in Exotelcraft Hub.\n- From now on, the update pop-up image will not be downloaded every time you start the game.\n- Added a loading circle to images fetched from the web (Modrinth mod icons in Exotelcraft Hub don't have it).\n- Other improvements to Bedrock like UI.\n- Added Amber armor trim material.\n\nFIXED BUGS IN: 6.0.0 BETA-1\n- Fixed rendering of certain things related to entities.\n- Fixed some items translations (Exotelcraft Signs and Mutated Stalk Piglin Head).\n- Exotelcraft Hanging Signs did not drop when destroyed.\n- Added some missing Exotelcraft Hanging Signs tags (this should fix some issues with these signs).\n- Some other Exotelcraft Signs fixes.\n- Fixed the loot tables of Exotel Grasses.\n- Fixed Moon Cow Glass on head.\n- Some fixes to Bedrock like UI (Ore UI).\n- Fixed Exotelcraft armor trim materials.\n- Other small bugfixes."
}
