{
  "image": "https://raw.githubusercontent.com/KedisPL/Exotelcraft-Hub/main/main/images/update_image.png",
  "title": "Exotelcraft latest news!",
  "description": "EXOTELCRAFT - 6.2.0 RELEASE\n\nA new version for Minecraft 1.21.10 has been released that adds a world map using the new Ender Map item, as well as most of the content from 25w14craftmine!\n\nHappy playing!\n\nCHANGES IN: 6.2.0 RELEASE:\n- Added an Ender Map. A new item that allows you to see the world map with markers and other features.\n- Most of 25w14craftmine has been added, but there are still minor things to fix and add.\n- All Exotelcraft chests were added to \"c\" chest tags.\n- The ability to change mod keybinds has been added to the options menu.\n- The UI in Bedrock Edition style (OreUI) now has buttons and other components defined in JSON. The new screens will also be defined in JSON (\"exotelcraft\\ui\"). A new death screen has also been added.\n- Polish translations have been added for 24w14potato and 25w14craftmine (PL: przetłumaczone przy użyciu AI i poprawione, więc proszę dać znać, jeżeli są błędy).\n- Advancements from the April Fools' features are now only enabled if the specific snapshot gamerule is enabled.\n- Improved SVG support in Exotelcraft Hub.\n- Some small changes.\n\nFIXED BUGS IN: 6.2.0 RELEASE:\n- Fixed player rendering in 2D instead of 3D in the hotbar when 3D Shareware v1.34 is enabled. You no longer need to click F5 to fix it.\n- The Locator Bar no longer overlaps the hotbar in 3D Shareware v1.34.\n- The title in the Fletching Table screen has been fixed in 24w14potato.\n- [Affected Multiplayer] Fixed a bug where all players would teleport when one player teleported to another dimension and couldn't exit it.\n- If mods modify the rendering of entities and this is not supported in the inventory, entities will render in Mob Trophies instead of causing the game to crash.\n- [NeoForge] Exotelcraft fluids should now work correctly.\n- Some fixes related to April Fools' features.\n- Some small fixes."
}
