{
	"image": "https://raw.githubusercontent.com/KedisPL/Exotelcraft-Hub/main/main/images/update_image.png",
	"title": "Exotelcraft latest news!",
	"description": "EXOTELCRAFT - 6.1.0 RELEASE\n\nThe new version with many bug fixes and improvements, as well as a partial addition of 25w14craftmine, is here!\n\nHappy playing!\n\nCHANGES IN: 6.1.0 RELEASE:\n- Added 25w14craftmine (Player Unlocks are not yet added, and it's still unfinished). It can be enabled or disabled like the other April Fools' features.\n- Markdown support in the Exotelcraft Hub has been greatly improved. Support for some HTML elements has been added, and it looks better.\n- Support for simple SVG images has been added to the Exotelcraft Hub.\n- Stalker will no longer trigger the Stalk Sensor instead of the Warden.\n- Some Stalk code was updated to match the current vanilla Sculk mechanics.\n- The Exotelcraft spawn egg textures have been updated.\n- The Flonre Cow texture was updated.\n- Eating 3D now shows an image of the Minecraft developers (the same image used in 3D Shareware v1.34).\n- Recipes and recipe advancements will no longer unlock if an item or block is disabled.\n- The Nether Reactor Core is fully disabled (for now).\n- The minecraft:milk_every_mob rule now works.\n- Added mod portals to the \"minecraft:portals\" tag.\n- Added THIRD_PARTY_LICENSES/LICENSE_Sodium.\n- Other small changes.\n\nFIXED BUGS IN: 6.1.0 RELEASE:\n- 3D Shareware v1.34 is now correctly saving in Exotelcraft options.\n- The Exotel Farmer translation key has been fixed.\n- [Affected 1.21.5] The Flonre Cow texture has been fixed.\n- Fixed an issue where the 3D Shareware v1.34 gamerule was not being applied in world creation when the 3D Shareware v1.34 option was enabled.\n- [Affected 1.21.5] Fixed the Villager texture in the Potato dimension rendering a missing texture when the Villager had no profession.\n- [Affected 1.21.5] Fixed the Poisonous Potato Cutter crash.\n- Fixed some bugs related to the Exotelcraft Hub.\n- Other small fixes."
}
